rtkconnectivity/rtl8752h_sdk/src/ble/profile/server/dfu_service.c
#include <string.h>
#include "gatt.h"
#include "gap_conn_le.h"
#include "patch_header_check.h"
#include "rtl876x_wdg.h"
#include "flash_nor_device.h"
#include "dfu_flash.h"
#include "dfu_api.h"
#include "dfu_service.h"
#include "otp.h"
#include "trace.h"
#include "board.h"
#include "otp_config.h"
#if (AON_WDG_ENABLE == 1)
#include "rtl876x_aon_wdg.h"
#endif

/*============================================================================*
 *                              Macros
 *============================================================================*/

//#define CAL_OFFSET(type, member) ((size_t)(&((type *)0)->member))

/*============================================================================*
 *                              External Variables
 *============================================================================*/
T_DFU_PARA g_dfu_para;
uint8_t *p_ota_temp_buffer_head;
uint16_t g_ota_tmp_buf_used_size;
uint8_t temp_image_num = 0;
T_TEMP_IMAGE_INFO temp_image_info[IMAGE_MAX - SecureBoot];


/*============================================================================*
 *                              Local Variables
 *============================================================================*/
uint8_t ota_temp_buffer_head[DFU_TEMP_BUFFER_SIZE];
static bool buffer_check_en = false;
bool is_ota_procedure = false;
static uint32_t dfu_resend_offset = 0;
static T_SERVER_ID dfu_service_id;

P_FUN_SERVER_GENERAL_CB pfn_dfu_service_cb = NULL;

const uint8_t   SILENCE_GATT_UUID128_DFU_SERVICE[16] = {GATT_UUID128_DFU_SERVICE};

T_ATTRIB_APPL gatt_dfu_service_table[] =
{

    /*-------------------------- DFU Service ---------------------------*/
    /* <<Primary Service>>, .. */
    {
        (ATTRIB_FLAG_VOID | ATTRIB_FLAG_LE),           /* flags     */
        {
            LO_WORD(GATT_UUID_PRIMARY_SERVICE),
            HI_WORD(GATT_UUID_PRIMARY_SERVICE),              /* type_value */
        },
        UUID_128BIT_SIZE,                                    /* bValueLen     */
        (void *)SILENCE_GATT_UUID128_DFU_SERVICE,           /* p_value_context */
        GATT_PERM_READ                                      /* permissions  */
    },



    /* <<Characteristic>>, .. */
    {
        ATTRIB_FLAG_VALUE_INCL,                     /* flags */
        {                                           /* type_value */
            LO_WORD(GATT_UUID_CHARACTERISTIC),
            HI_WORD(GATT_UUID_CHARACTERISTIC),
            GATT_CHAR_PROP_WRITE_NO_RSP/* characteristic properties */
            /* characteristic UUID not needed here, is UUID of next attrib. */
        },
        1,                                          /* bValueLen */
        NULL,
        GATT_PERM_READ                              /* permissions */
    },
    /*--- DFU packet characteristic value ---*/
    {
        ATTRIB_FLAG_VALUE_APPL | ATTRIB_FLAG_UUID_128BIT,                              /* flags */
        {                                                           /* type_value */
            GATT_UUID128_DFU_DATA
        },
        0,                                                 /* bValueLen */
        NULL,
#if DFU_SERVER_REQUIRE_AUTH
        GATT_PERM_WRITE_AUTHEN_MITM_REQ                             /* permissions */
#else
        GATT_PERM_WRITE           /* permissions */
#endif
    },
    /* <<Characteristic>>, .. */
    {
        ATTRIB_FLAG_VALUE_INCL,                     /* flags */
        {                                           /* type_value */
            LO_WORD(GATT_UUID_CHARACTERISTIC),
            HI_WORD(GATT_UUID_CHARACTERISTIC),
            (GATT_CHAR_PROP_WRITE |                   /* characteristic properties */
             GATT_CHAR_PROP_NOTIFY)
            /* characteristic UUID not needed here, is UUID of next attrib. */
        },
        1,                                          /* bValueLen */
        NULL,
        GATT_PERM_READ                              /* permissions */
    },
    /*--- DFU Control Point value ---*/
    {
        ATTRIB_FLAG_VALUE_APPL | ATTRIB_FLAG_UUID_128BIT,                              /* flags */
        {                                                           /* type_value */
            GATT_UUID128_DFU_CONTROL_POINT
        },
        0,                                                 /* bValueLen */
        NULL,
#if DFU_SERVER_REQUIRE_AUTH
        GATT_PERM_WRITE_AUTHEN_MITM_REQ                             /* permissions */
#else
        GATT_PERM_WRITE           /* permissions */
#endif
    },
    /* client characteristic configuration */
    {
        (ATTRIB_FLAG_VALUE_INCL |                   /* flags */
         ATTRIB_FLAG_CCCD_APPL),
        {                                           /* type_value */
            LO_WORD(GATT_UUID_CHAR_CLIENT_CONFIG),
            HI_WORD(GATT_UUID_CHAR_CLIENT_CONFIG),
            /* NOTE: this value has an instantiation for each client, a write to */
            /* this attribute does not modify this default value:                */
            LO_WORD(GATT_CLIENT_CHAR_CONFIG_DEFAULT), /* client char. config. bit field */
            HI_WORD(GATT_CLIENT_CHAR_CONFIG_DEFAULT)
        },
        2,                                          /* bValueLen */
        NULL,
#if DFU_SERVER_REQUIRE_AUTH
        (GATT_PERM_READ | GATT_PERM_WRITE_AUTHEN_MITM_REQ)          /* permissions */
#else
        (GATT_PERM_READ | GATT_PERM_WRITE)          /* permissions */
#endif
    }

};


/*============================================================================*
 *                              Local Functions
 *============================================================================*/
__attribute__((weak)) bool dfu_soc_check_img_version(uint16_t image_id, uint32_t version)
{
    return true;
}

/**
 * @brief dfu_buffer_check_process
 *
 * @param buffer_check_size     size for buffer check.
 * @param buffer_crc            calced buffer crc value.
 * @return None
*/
void dfu_buffer_check_process(uint8_t conn_id, uint16_t buffer_check_size, uint16_t buffer_crc)
{
    uint8_t notif_data[DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC] = {0};
    notif_data[0] = DFU_OPCODE_NOTIFICATION;
    notif_data[1] = DFU_OPCODE_REPORT_BUFFER_CRC;

