rtkconnectivity/rtl8752h_sdk/src/ble/profile/server/dfu_service.c
                }
                //erase ok
                g_ota_tmp_buf_used_size = 0;
                g_dfu_para.cur_offset =  dfu_resend_offset;
                DFU_PRINT_INFO1("<==dfu_buffer_check_process: erase ok! cur_offset=%d", g_dfu_para.cur_offset);
                notif_data[2] = DFU_ARV_FAIL_PROG_ERROR;
                LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
                server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                 notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
                return;
            }
        }
    }
    else
    {
        DFU_PRINT_ERROR4("<==dfu_buffer_check_process: Error buffer_check_size=%d,buf_used_size=%d,cur_offset=%d,image_total_length=%d",
                         buffer_check_size, g_ota_tmp_buf_used_size,
                         g_dfu_para.cur_offset, g_dfu_para.image_total_length);
        //flush buffer.
        g_ota_tmp_buf_used_size = 0;
        notif_data[2] = DFU_ARV_FAIL_LENGTH_ERROR;
        LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
        server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                         notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
        return;
    }
}

void dfu_notify_conn_para_update_req(uint8_t conn_id, T_DFU_ARV_ERROR_CODE error_code)
{
    if (g_dfu_para.dfu_conn_para_update_in_progress == true)
    {
        g_dfu_para.dfu_conn_para_update_in_progress = false;
        uint8_t notif_data[3] = {0};
        notif_data[0] = DFU_OPCODE_NOTIFICATION;
        notif_data[1] = DFU_OPCODE_CONN_PARA_TO_UPDATE_REQ;
        notif_data[2] = error_code;

        DFU_PRINT_INFO1("<==dfu_notify_conn_para_update_req error_code=0x%x", error_code);
        /* Connection Param Update rejected, we should notify the fail result to remote device. */
        server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                         notif_data, DFU_NOTIFY_LENGTH_CONN_PARA_UPDATE_REQ, GATT_PDU_TYPE_NOTIFICATION);
    }
}

void dfu_service_handle_valid_fw(uint8_t conn_id)
{
    uint8_t notif_data[DFU_NOTIFY_LENGTH_VALID_FW] = {0};
    bool check_result = false;
    bool is_enable_bank_switch = is_ota_support_bank_switch();

    if (is_enable_bank_switch || g_dfu_para.ctrl_header.image_id == IMAGE_USER_DATA
        || g_dfu_para.ctrl_header.image_id == IMAGE_USER_DATA2)
    {
        check_result = dfu_check_checksum(g_dfu_para.ctrl_header.image_id, 0);
    }
    else
    {
        check_result = dfu_check_checksum(temp_image_info[temp_image_num].image_id,
                                          temp_image_info[temp_image_num].image_offset);
    }
    DFU_PRINT_INFO1("dfu_service_handle_valid_fw: check_result=%d (1: Success, 0: Fail)", check_result);

    if (check_result)
    {
        if (!is_enable_bank_switch && g_dfu_para.ctrl_header.image_id != IMAGE_USER_DATA
            && g_dfu_para.ctrl_header.image_id != IMAGE_USER_DATA2)
        {
            temp_image_num ++;
            DFU_PRINT_INFO1("DFU_OPCODE_VALID_FW: temp_image_num=%d ", temp_image_num);
        }

        notif_data[2] = DFU_ARV_SUCCESS;
    }
    else
    {
        notif_data[2] = DFU_ARV_FAIL_CRC_ERROR;
    }
    notif_data[0] = DFU_OPCODE_NOTIFICATION;
    notif_data[1] = DFU_OPCODE_VALID_FW;
    server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                     notif_data, DFU_NOTIFY_LENGTH_VALID_FW, GATT_PDU_TYPE_NOTIFICATION);
}


void dfu_service_handle_active_image(void)
{
    T_IMG_HEADER_FORMAT *p_header = NULL;

    /* check OTA temp or running bank to see if received image is OK.*/
    if (!is_ota_support_bank_switch())
    {
        for (uint8_t i = 0; i < temp_image_num; i++)
        {
            uint32_t base_addr = dfu_get_temp_ota_bank_addr_by_img_id(temp_image_info[i].image_id);
            p_header = (T_IMG_HEADER_FORMAT *)(base_addr + temp_image_info[i].image_offset);
            if (p_header)
            {
                dfu_set_image_ready(p_header, temp_image_info[i].dfu_compressed_mode);
            }
        }
    }
    else
    {
        extern uint16_t valid_bitmap;
        DFU_PRINT_INFO1("==>dfu_service_handle_active_image: bitmap 0x%x", valid_bitmap);
        //support bank switch
        for (uint16_t img_id = IMAGE_MAX - 1; img_id >= OTA; img_id--)
        {
            if (get_valid_bitmap((T_IMG_ID)img_id))
            {
                /* check OTA temp to see if received image is OK.*/
                p_header = (T_IMG_HEADER_FORMAT *)dfu_get_temp_ota_bank_addr_by_img_id((T_IMG_ID)img_id);
                dfu_set_image_ready(p_header, false);
            }
        }
    }

    for (uint16_t img_id = IMAGE_USER_DATA_FIRST; img_id < IMAGE_USER_DATA_MAX; img_id++)
    {
        if (get_valid_bitmap((T_IMG_ID)img_id))
        {
            /* check user data to see if received image is OK.*/
            p_header = (T_IMG_HEADER_FORMAT *)dfu_get_temp_ota_bank_addr_by_img_id((T_IMG_ID)img_id);
            dfu_set_image_ready(p_header, false);
        }
    }
}

/**
 * @brief dfu_service_handle_control_point_req
 *
 * @param length     control point cmd length.
 * @param p_value    control point cmd address..
 * @return None
*/
void dfu_service_handle_control_point_req(uint8_t conn_id, uint16_t length,
                                          uint8_t *p_value)
{
    T_APP_RESULT w_cause = APP_RESULT_SUCCESS;
    T_DFU_CTRL_POINT dfu_control_point;
    uint8_t *p = p_value + 1;
    uint8_t notif_data[DFU_NOTIFY_LENGTH_MAX] = {0};

    T_DFU_CALLBACK_DATA callback_data;
    callback_data.conn_id = conn_id;
    callback_data.msg_type = SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE;
    callback_data.msg_data.write.write_attrib_index = INDEX_DFU_CONTROL_POINT_CHAR_VALUE;

    dfu_control_point.opcode = *p_value;
    DFU_PRINT_TRACE2("==>dfu_service_handle_control_point_req: opcode=0x%x, length=%d",
                     dfu_control_point.opcode, length);

    if (dfu_control_point.opcode >= DFU_OPCODE_MAX || dfu_control_point.opcode <= DFU_OPCODE_MIN)
    {
        notif_data[0] = DFU_OPCODE_NOTIFICATION;
        notif_data[1] = dfu_control_point.opcode;
        notif_data[2] = 0xff;
        server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                         notif_data, DFU_NOTIFY_LENGTH_START_DFU, GATT_PDU_TYPE_NOTIFICATION);
        return;
    }

    switch (dfu_control_point.opcode)
    {
    case DFU_OPCODE_START_DFU: //0x01
        if (length == DFU_LENGTH_START_DFU)/*4 bytes is padding for encrypt*/
        {
            if (dfu_get_enc_setting())
            {
                DFU_PRINT_INFO1("ctrl header before decryped=%b", TRACE_BINARY(16, p));
                dfu_hw_aes_decrypt_image(p, p, 16);
                DFU_PRINT_INFO1("ctrl header after decryped=%b", TRACE_BINARY(16, p));
            }
            LE_ARRAY_TO_UINT16(dfu_control_point.start_dfu.crc16, p);
            p += 2;
            dfu_control_point.start_dfu.ic_type = (*p);
            p += 1;
            dfu_control_point.start_dfu.secure_version = (*p);
            p += 1;
            LE_ARRAY_TO_UINT16(dfu_control_point.start_dfu.ctrl_flag.value, p);
            p += 2;
            LE_ARRAY_TO_UINT16(dfu_control_point.start_dfu.image_id, p);
            p += 2;
            LE_ARRAY_TO_UINT32(dfu_control_point.start_dfu.payload_len, p);
            p += 4;
            LE_ARRAY_TO_UINT8(g_dfu_para.start_dfu_mode, p);

