rtkconnectivity/rtl8752h_sdk/src/ble/profile/server/dfu_service.c
            DFU_PRINT_INFO6("DFU_OPCODE_START_DFU: ic_type=0x%x, secure_version=0x%x, ctrl_flag.value=0x%x, image_id=0x%x,crc16=0x%x, payload_len=%d",
                            dfu_control_point.start_dfu.ic_type,
                            dfu_control_point.start_dfu.secure_version,
                            dfu_control_point.start_dfu.ctrl_flag.value,
                            dfu_control_point.start_dfu.image_id,
                            dfu_control_point.start_dfu.crc16,
                            dfu_control_point.start_dfu.payload_len
                           );
            g_dfu_para.ctrl_header.ic_type = dfu_control_point.start_dfu.ic_type;
            g_dfu_para.ctrl_header.ctrl_flag.value = dfu_control_point.start_dfu.ctrl_flag.value;
            g_dfu_para.ctrl_header.image_id = dfu_control_point.start_dfu.image_id;
            g_dfu_para.ctrl_header.crc16 = dfu_control_point.start_dfu.crc16;
            g_dfu_para.ctrl_header.payload_len = dfu_control_point.start_dfu.payload_len;

            dfu_compressed_mode = (g_dfu_para.start_dfu_mode == START_DFU_COMPRESSED_MODE_VALUE);
            DFU_PRINT_INFO3("DFU_OPCODE_START_DFU: image_total_length=%d, start_dfu_mode=0x%x(%d: compressed mode, others: default mode)",
                            g_dfu_para.image_total_length, g_dfu_para.start_dfu_mode, START_DFU_COMPRESSED_MODE_VALUE);
            if (dfu_compressed_mode)
            {
                g_dfu_para.image_total_length = g_dfu_para.ctrl_header.payload_len + DECODE_OFFSET;
            }
            else
            {
                g_dfu_para.image_total_length = g_dfu_para.ctrl_header.payload_len + IMG_HEADER_SIZE;
            }

            /*check if start dfu fileds are vaild*/
            if (g_dfu_para.ctrl_header.ic_type == IMG_IC_TYPE)
            {
                if (((g_dfu_para.ctrl_header.image_id >= OTA) && (g_dfu_para.ctrl_header.image_id < IMAGE_MAX))
                    || (g_dfu_para.ctrl_header.image_id == IMAGE_USER_DATA)
                    || (g_dfu_para.ctrl_header.image_id == IMAGE_USER_DATA2))
                {
                    is_ota_procedure = true;

                    //user data image needn't record into temp info
                    if (g_dfu_para.ctrl_header.image_id  != IMAGE_USER_DATA &&
                        g_dfu_para.ctrl_header.image_id  != IMAGE_USER_DATA2)
                    {
                        /*disable bank switch, need record temp image info*/
                        if (!is_ota_support_bank_switch())
                        {
                            temp_image_info[temp_image_num].image_id = (T_IMG_ID)g_dfu_para.ctrl_header.image_id;
//                          temp_image_info[temp_image_num].image_size = UP_ALIGN(g_dfu_para.image_total_length, FMC_SEC_SECTION_LEN);
                            temp_image_info[temp_image_num].image_size = g_dfu_para.image_total_length;
                            temp_image_info[temp_image_num].dfu_compressed_mode = dfu_compressed_mode;
                            if (temp_image_num == 0)
                            {
                                temp_image_info[temp_image_num].image_offset = 0;
                            }
                            else
                            {
                                temp_image_info[temp_image_num].image_offset = temp_image_info[temp_image_num - 1].image_offset +
                                                                               temp_image_info[temp_image_num - 1].image_size;
                            }
                        }
                        DFU_PRINT_INFO5("DFU_OPCODE_START_DFU: image_num=%d, image_id=0x%x, image_size=0x%x, image_offset=0x%x, compressed_mode %d",
                                        temp_image_num, temp_image_info[temp_image_num].image_id,
                                        temp_image_info[temp_image_num].image_size, temp_image_info[temp_image_num].image_offset,
                                        temp_image_info[temp_image_num].dfu_compressed_mode);
                    }


                    callback_data.msg_data.write.opcode = DFU_WRITE_START;
                    callback_data.msg_data.write.length = DFU_HEADER_SIZE;
                    callback_data.msg_data.write.p_value = (uint8_t *)&g_dfu_para.ctrl_header;
                    if (pfn_dfu_service_cb)
                    {
                        w_cause = pfn_dfu_service_cb(dfu_service_id, (void *)&callback_data);
                        if (w_cause != APP_RESULT_SUCCESS)
                        {
                            return;
                        }
                    }

                    g_dfu_para.cur_offset += 0;
                    DFU_PRINT_INFO0("DFU_OPCODE_START_DFU: start success!");

                    notif_data[0] = DFU_OPCODE_NOTIFICATION;
                    notif_data[1] = DFU_OPCODE_START_DFU;
                    notif_data[2] = DFU_ARV_SUCCESS;
                    server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                     notif_data, DFU_NOTIFY_LENGTH_START_DFU, GATT_PDU_TYPE_NOTIFICATION);

                }
                else
                {
                    DFU_PRINT_ERROR1("DFU_OPCODE_START_DFU: image id=0x%x Error!", g_dfu_para.ctrl_header.image_id);
                    notif_data[0] = DFU_OPCODE_NOTIFICATION;
                    notif_data[1] = DFU_OPCODE_START_DFU;
                    notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
                    server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                     notif_data, DFU_NOTIFY_LENGTH_START_DFU, GATT_PDU_TYPE_NOTIFICATION);
                    return;
                }
            }
            else
            {
                DFU_PRINT_ERROR1("DFU_OPCODE_START_DFU: ic type=0x%x Error!", g_dfu_para.ctrl_header.ic_type);
                notif_data[0] = DFU_OPCODE_NOTIFICATION;
                notif_data[1] = DFU_OPCODE_START_DFU;
                notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
                server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                 notif_data, DFU_NOTIFY_LENGTH_START_DFU, GATT_PDU_TYPE_NOTIFICATION);
                return;
            }
        }
        break;

    case DFU_OPCODE_RECEIVE_FW_IMAGE_INFO://0x02
        if (length == DFU_LENGTH_RECEIVE_FW_IMAGE_INFO)
        {
            LE_ARRAY_TO_UINT16(g_dfu_para.ctrl_header.image_id, p);
            p += 2;
            LE_ARRAY_TO_UINT32(g_dfu_para.cur_offset, p);
            if ((g_dfu_para.cur_offset == 0) || (g_dfu_para.cur_offset == DFU_HEADER_SIZE))
            {
                g_ota_tmp_buf_used_size = 0;
                dfu_resend_offset = 0;
            }
            DFU_PRINT_INFO3("DFU_OPCODE_RECEIVE_FW_IMAGE_INFO: image_id=0x%x, cur_offset=%d, g_ota_tmp_buf_used_size=%d",
                            g_dfu_para.ctrl_header.image_id, g_dfu_para.cur_offset, g_ota_tmp_buf_used_size);
        }
        else
        {
            DFU_PRINT_ERROR1("DFU_OPCODE_RECEIVE_FW_IMAGE_INFO: length=%d Error!", length);
        }
        break;

    case DFU_OPCODE_VALID_FW://0x03

        if (length == DFU_LENGTH_VALID_FW)
        {
            LE_ARRAY_TO_UINT16(g_dfu_para.ctrl_header.image_id, p);
            DFU_PRINT_TRACE1("DFU_OPCODE_VALID_FW: image_id=0x%x", g_dfu_para.ctrl_header.image_id);

            /*if ota large img, need modify wdg timeout period*/
            if (OTP->wdgEnableInRom && g_dfu_para.image_total_length > 0x100000)
            {
                /*1M and less---4s, 2M and less---8s,..., 8M and less---32s*/
                uint32_t img_align_len = ((g_dfu_para.image_total_length + (0x100000 - 1)) & (~(0x100000 - 1)));
                uint8_t wdg_period_4s = (img_align_len / 0x100000);
                uint16_t div_factor = (32 * wdg_period_4s - 1);
                DFU_PRINT_TRACE2("DFU_OPCODE_VALID_FW: Change WDG Period to %ds, div_factor=%d", wdg_period_4s << 2,
                                 div_factor);
                WDG_Config(div_factor, 15, RESET_ALL); //31 - 4s, 63 - 8s
            }
            /*It is not recommended to do things that take a long time in upperstack task cb.
                So dfu service cb need send msg to app task to handle checksum image if support silent ota.
                While app task must handle IO_MSG_TYPE_DFU_VALID_FW by calling dfu_service_handle_valid_fw.
            */
#if (AON_WDG_ENABLE == 1)
            bool aon_wdg_en = AON_WDG_IsEnable();
            if (aon_wdg_en)
            {
                aon_wdg_disable();
            }
#endif
        }
        else
        {
            DFU_PRINT_ERROR1("DFU_OPCODE_VALID_FW: length=%d Error!", length);
        }
        break;

