rtkconnectivity/rtl8752h_sdk/src/ble/profile/server/dfu_service.c
            notif_data[0] = DFU_OPCODE_NOTIFICATION;
            notif_data[1] = DFU_OPCODE_BUFFER_CHECK_EN;
#if (DFU_BUFFER_CHECK_ENABLE == 1)
            buffer_check_en = true;
            notif_data[2] = DFU_ARV_SUCCESS;
#else
            buffer_check_en = false;
            notif_data[2] = DFU_ARV_FAIL_OPERATION;
#endif
            LE_UINT16_TO_ARRAY(&notif_data[3], DFU_TEMP_BUFFER_SIZE);
            LE_UINT16_TO_ARRAY(&notif_data[5], g_dfu_para.mtu_size);
            server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                             notif_data, DFU_NOTIFY_LENGTH_BUFFER_CHECK_EN, GATT_PDU_TYPE_NOTIFICATION);
        }
        break;

    case DFU_OPCODE_REPORT_BUFFER_CRC:        //0x0a
        {
            uint16_t mBufSize;
            uint16_t mCrcVal;
            LE_ARRAY_TO_UINT16(mBufSize, p);
            p += 2;
            LE_ARRAY_TO_UINT16(mCrcVal, p);
            DFU_PRINT_INFO2("DFU_OPCODE_REPORT_BUFFER_CRC: mBufSize=0x%x, mCrcVal=0x%x", mBufSize, mCrcVal);
            dfu_buffer_check_process(conn_id, mBufSize, mCrcVal);
        }
        break;

    case DFU_OPCODE_RECEIVE_IC_TYPE://0x0b
        {
            uint8_t ic_type = 0; //0 means invalid ic type
            notif_data[0] = DFU_OPCODE_NOTIFICATION;
            notif_data[1] = DFU_OPCODE_RECEIVE_IC_TYPE;
            if (dfu_report_target_ic_type(OTA, &ic_type))
            {
                notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
                notif_data[3] =  ic_type;
            }
            else
            {
                notif_data[2] = DFU_ARV_SUCCESS;
                notif_data[3] =  ic_type;
            }
            DFU_PRINT_INFO1("DFU_OPCODE_RECEIVE_IC_TYPE: ic_type=0x%x", ic_type);
            server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                             notif_data, DFU_NOTIFY_LENGTH_RECEIVE_IC_TYPE, GATT_PDU_TYPE_NOTIFICATION);
        }
        break;

#if (ENABLE_BANK_SWITCH_COPY_APP_DATA == 1)
    case DFU_OPCODE_COPY_IMG://0x0c
        {
            uint32_t dlAddress, dlSize;
            LE_ARRAY_TO_UINT16(g_dfu_para.ctrl_header.image_id, p);
            p += 2;
            LE_ARRAY_TO_UINT32(dlAddress, p);
            p += 4;
            LE_ARRAY_TO_UINT32(dlSize, p);
            DFU_PRINT_TRACE2("DFU_OPCODE_COPY_IMG: dlAddress=0x%x,dlSize=0x%x", dlAddress,
                             dlSize);

            notif_data[0] = DFU_OPCODE_NOTIFICATION;
            notif_data[1] = DFU_OPCODE_COPY_IMG;

            if (dfu_copy_img(g_dfu_para.ctrl_header.image_id, dlAddress, dlSize))
            {
                notif_data[2] = DFU_ARV_SUCCESS;
            }
            else
            {
                notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
            }
            server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                             notif_data, DFU_NOTIFY_LENGTH_ARV, GATT_PDU_TYPE_NOTIFICATION);
        }
        break;
#endif  //end ENABLE_BANK_SWITCH_COPY_APP_DATA
    case DFU_OPCODE_CHECK_IMAGE_VER://0x0d
        {
            if (length == DFU_LENGTH_IMAGE_VERSION)
            {
                uint16_t image_id;
                uint32_t version;
                LE_ARRAY_TO_UINT16(image_id, p);
                LE_ARRAY_TO_UINT32(version, p + 2);
                DFU_PRINT_INFO2("DFU_OPCODE_CHECK_IMAGE_VER: img_id 0x%x, version %x", image_id, version);

                if (dfu_soc_check_img_version(image_id, version))
                {
                    DFU_PRINT_INFO0("DFU_OPCODE_CHECK_IMAGE_VER length version check success!!");
                    notif_data[2] =  DFU_ARV_SUCCESS ;
                    g_dfu_para.is_need_dfu = true;
                }
                else
                {
                    DFU_PRINT_INFO0("DFU_OPCODE_CHECK_IMAGE_VER Image check failed!!");
                    notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
                    g_dfu_para.is_need_dfu = false;
                }
            }
            else
            {
                DFU_PRINT_INFO0("DFU_OPCODE_CHECK_IMAGE_VER length error!!");
                notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
            }

            notif_data[0] = DFU_OPCODE_NOTIFICATION;
            notif_data[1] = DFU_OPCODE_CHECK_IMAGE_VER;

            server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                             notif_data, DFU_NOTIFY_LENGTH_ARV, GATT_PDU_TYPE_NOTIFICATION);
        }
        break;
    case DFU_OPCODE_HANDSHAKE://0x0e
        {
            if (length == DFU_LENGTH_HANDSHAKE)
            {
                DFU_PRINT_INFO0("DFU_OPCODE_HANDSHAKE");

                uint8_t handshake_data[16];
                memcpy(handshake_data, p_value + 1, 16);

                /* decrypt data */
                if (dfu_get_enc_setting())
                {
                    dfu_hw_aes_decrypt_image(handshake_data, handshake_data, 16);
                }

                /* increase data value */
                for (uint8_t index = 0; index < 16; index++)
                {
                    handshake_data[index] += 1;
                }

                /* encrypt data */
                if (dfu_get_enc_setting())
                {
                    dfu_encrypt_handshake_data(handshake_data);
                }

                notif_data[0] = DFU_OPCODE_NOTIFICATION;
                notif_data[1] = DFU_OPCODE_HANDSHAKE;
                notif_data[2] = DFU_ARV_SUCCESS;
                memcpy(&notif_data[3], handshake_data, 16);
                server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                 notif_data, DFU_NOTIFY_LENGTH_HANDSHAKE, GATT_PDU_TYPE_NOTIFICATION);
            }
            else
            {
                DFU_PRINT_ERROR1("DFU_OPCODE_HANDSHAKE: length=%d Error!", length);
                notif_data[0] = DFU_OPCODE_NOTIFICATION;
                notif_data[1] = DFU_OPCODE_HANDSHAKE;
                notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
                memset(&notif_data[3], 0, 16);
                server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                 notif_data, DFU_NOTIFY_LENGTH_HANDSHAKE, GATT_PDU_TYPE_NOTIFICATION);
            }
        }
        break;

    default:
        {
            DFU_PRINT_TRACE1("dfu_service_handle_control_point_req: Unknown Opcode=0x%x",
                             dfu_control_point.opcode);
        }
        break;
    }
}


/**
 * @brief dfu_service_handle_packet_req
 *
 * @param length     data reviewed length.
 * @param p_value    data receive point address.
 * @return None
*/
void dfu_service_handle_packet_req(uint8_t conn_id, uint16_t length, uint8_t *p_value)
{
    T_APP_RESULT w_cause = APP_RESULT_SUCCESS;
    T_DFU_CALLBACK_DATA callback_data;
    callback_data.conn_id = conn_id;
    callback_data.msg_type = SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE;
    callback_data.msg_data.write.write_attrib_index = INDEX_DFU_PACKET_VALUE;
    callback_data.msg_data.write.length = length;
    callback_data.msg_data.write.p_value = p_value;

