rtkconnectivity/rtl8752h_sdk/src/ble/profile/server/dfu_service.c
}

/**
 * @brief write characteristic data from service.
 *
 * @param ServiceID          ServiceID to be written.
 * @param iAttribIndex       Attribute index of characteristic.
 * @param wLength            length of value to be written.
 * @param pValue             value to be written.
 * @return Profile procedure result
*/
T_APP_RESULT dfu_attr_write_cb(uint8_t conn_id, uint8_t service_id, uint16_t attrib_index,
                               T_WRITE_TYPE write_type,
                               uint16_t length, uint8_t *p_value, P_FUN_WRITE_IND_POST_PROC *p_write_ind_post_proc)
{
    T_APP_RESULT w_cause = APP_RESULT_SUCCESS;
    T_DFU_CALLBACK_DATA callback_data;
    callback_data.conn_id = conn_id;
    callback_data.msg_type = SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE;
    callback_data.msg_data.write.write_attrib_index = attrib_index;
    callback_data.msg_data.write.length = length;
    callback_data.msg_data.write.p_value = p_value;

    /* Notify Application. */
    callback_data.msg_data.write.opcode = DFU_WRITE_ATTR_ENTER;
    if (pfn_dfu_service_cb)
    {
        w_cause = pfn_dfu_service_cb(service_id, (void *)&callback_data);
        if (w_cause != APP_RESULT_SUCCESS)
        {
            return w_cause;
        }
    }

    if (attrib_index == INDEX_DFU_CONTROL_POINT_CHAR_VALUE)
    {
        dfu_service_handle_control_point_req(conn_id, length, p_value);
    }
    else if (attrib_index == INDEX_DFU_PACKET_VALUE)
    {
        dfu_service_handle_packet_req(conn_id, length, p_value);
    }
    else
    {
        DFU_PRINT_INFO1("dfu_attr_write_cb fail! attrib_index=%d", attrib_index);
        w_cause = APP_RESULT_ATTR_NOT_FOUND;
    }

    /* Notify Application. */
    callback_data.msg_data.write.opcode = DFU_WRITE_ATTR_EXIT;
    if (pfn_dfu_service_cb)
    {
        w_cause = pfn_dfu_service_cb(service_id, (void *)&callback_data);
        if (w_cause != APP_RESULT_SUCCESS)
        {
            return w_cause;
        }
    }

    return w_cause;
}

/**
 * @brief update CCCD bits from stack.
 *
 * @param ServiceId          Service ID.
 * @param Index          Attribute index of characteristic data.
 * @param wCCCBits         CCCD bits from stack.
 * @return None
*/
void dfu_cccd_update_cb(uint8_t conn_id, T_SERVER_ID service_id, uint16_t index, uint16_t ccc_bits)
{
    T_DFU_CALLBACK_DATA callback_data;
    callback_data.msg_type = SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION;
    callback_data.conn_id = conn_id;
    bool b_handle = true;
    DFU_PRINT_INFO2("dfu_cccd_update_cb: index=%d, ccc_bits=0x%x", index, ccc_bits);
    switch (index)
    {
    case INDEX_DFU_CHAR_CCCD_INDEX:
        {
            if (ccc_bits & GATT_CLIENT_CHAR_CONFIG_NOTIFY)
            {
                // Enable Notification
                callback_data.msg_type = SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION;
                callback_data.msg_data.notification_indification_index = DFU_NOTIFY_ENABLE;
            }
            else
            {
                callback_data.msg_type = SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION;
                callback_data.msg_data.notification_indification_index = DFU_NOTIFY_DISABLE;
            }
            break;
        }
    default:
        {
            b_handle = false;
            break;
        }

    }
    /* Notify Application. */
    if (pfn_dfu_service_cb && (b_handle == true))
    {
        T_APP_RESULT update_cause = pfn_dfu_service_cb(service_id, (void *)&callback_data);
        if (update_cause != APP_RESULT_SUCCESS)
        {
            return;
        }
    }

    return;
}

/**
 * @brief OTA ble Service Callbacks.
*/
const T_FUN_GATT_SERVICE_CBS DfuServiceCBs =
{
    NULL,                // Read callback function pointer
    dfu_attr_write_cb,   // Write callback function pointer
    dfu_cccd_update_cb   // CCCD update callback function pointer
};

/**
 * @brief  add OTA ble service to application.
 *
 * @param  pFunc          pointer of app callback function called by profile.
 * @return service ID auto generated by profile layer.
 * @retval ServiceId
*/
uint8_t dfu_add_service(void *pFunc)
{
    if (false == server_add_service(&dfu_service_id,
                                    (uint8_t *)gatt_dfu_service_table,
                                    sizeof(gatt_dfu_service_table),
                                    DfuServiceCBs))
    {
        DFU_PRINT_ERROR1("dfu_add_service: service_id=%d", dfu_service_id);
        dfu_service_id = 0xff;
        return dfu_service_id;
    }
    pfn_dfu_service_cb = (P_FUN_SERVER_GENERAL_CB)pFunc;
    p_ota_temp_buffer_head = ota_temp_buffer_head;

    return dfu_service_id;
}


